### Loading Data and Statistical Analysis

In [4]:
import numpy as np
import pandas as pd
# import matplotlib.pyplot as plt

In [5]:
# we may load external data
# df = pd.read_csv('data/salaries.csv') # or xml, json, excel, etc.
# or load from a URL
url = 'https://raw.githubusercontent.com/onionmccabbage/pythonFurtherAdvancedSept2025/refs/heads/main/data/Salaries.csv'
df = pd.read_csv(url)
df.head(7) # or tail()
df.describe() # plenty to give actionable statistics

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [6]:
# we may examine our data strucure
df.columns
df.size
df['salary'].mean() # for one column
df[['service', 'salary']].mean() # a list of columns
df.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

#### Grouping and Aggregating Data

In [7]:
df_rank = df.groupby(['rank'])
# anything done in np or pd is very performant - even for massive data sets
df_rank[['salary']].mean() # consider single [] or double [[]]

                  salary
rank
AssocProf   91786.230769
AsstProf    81362.789474
Prof       123624.804348

In [8]:
# some meaningful analysis
df_n = df.groupby(['sex'])
df_n[['salary']].mean()
df_years = df.groupby('rank')
df_years[['service']].mean()

             service
rank
AssocProf  11.307692
AsstProf    2.210526
Prof       21.413043

In [11]:
# mini challenge
# show the mean salary for each rank, grouped by sex
whichColumns = ['rank', 'sex'] # it is sometimes useful to write list first
mf = df.groupby(whichColumns)  # ... then use these lists within our code
s = ['salary']
mf[s].mean()

                         salary
rank      sex
AssocProf Female   88512.800000
          Male    102697.666667
AsstProf  Female   78049.909091
          Male     85918.000000
Prof      Female  121967.611111
          Male    124690.142857

In [15]:
# more data analysese
# find mean salary for all salaries over 120000 grouped by rank
b = df[ df['salary']>120000 ] 
# b.groupby(['rank'])
b[['salary']].mean()

salary    141722.4
dtype: float64

#### Aggregating data

In [19]:
# we can aggregate values using .agg()
df[['phd', 'salary']].agg(['max','min','mean'])

            phd         salary
max   56.000000  186960.000000
min    1.000000   57800.000000
mean  19.705128  108023.782051